--------------------------------------------------------------------------------
Makelog started: 2023-03-23 12:39:16
Working directory: /export/home/dor/cxu/innovation_projs/analysis/science_geo/jrnl_samp_size/code
--------------------------------------------------------------------------------
External links successfully created!

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Unlimited-user 4-core , expiring 17 Nov 2023
Serial number: 501709306977
  Licensed to: Harvard Business School
               Research Computing

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 120,000; see help set_maxvar.

. do "/export/home/dor/cxu/innovation_projs/analysis/science_geo/jrnl_samp_size
> /code/analysis.do" 

. set more off

. clear all

. capture log close

. program drop _all

. set scheme modern

. pause on

. set seed 8975

. here, set
/export/home/dor/cxu/innovation_projs/analysis/science_geo/jrnl_samp_size/code/

. 
. program main
  1.     global country_name "countries"
  2.     global us_state_name "US states"
  3.     global area_name "US cities"
  4.     global city_full_name "world cities"
  5.     global inst_name "institutions"
  6.     foreach samp in cns scisub demsci med { 
  7.         local samp_type = cond(strpos("`samp'", "cns")>0 | strpos("`samp'"
> ,"med")>0, "main", "robust")
  8.         if "`samp'" == "med" { 
  9.             local samp_type "clinical"
 10.         }
 11.         get_total_articles, samp(`samp') samp_type(`samp_type')
 12.         foreach data in newfund {
 13.         if "`samp'" == "med" {
 14.             local data clin
 15.         }
 16.         di "SAMPLE IS : `samp' `data'"
 17.             top_jrnls, data(`data') samp(`samp') 
 18.             samp_size, data(`data') samp(`samp') 
 19.             mat N_`samp' = nullmat(N_`samp') \ N_`data'_`samp'
 20.         }
 21.         mat N_samp = nullmat(N_samp) \ N_`samp'
 22.         if "`samp'" != "med" {
 23.             mat top_jrnls_`samp' =  nullmat(top_jrnls_`samp') , top_jrnls_
> `samp'_N
 24.             mat top_jrnls =  nullmat(top_jrnls) \ top_jrnls_`samp'
 25.         }
 26.     }
 27.     foreach file in top_jrnls N_samp top_jrnls_med {
 28.         qui matrix_to_txt, saving("../output/tables/`file'.txt") matrix(`f
> ile') ///
>            title(<tab:`file'>) format(%20.4f) replace
 29.          }
 30. end

. 
. program get_total_articles 
  1.     syntax, samp(str) samp_type(str)
  2.     use ../external/`samp_type'_filtered/all_jrnl_articles_`samp'Q1, clear
  3.     // delete some weird metastudies that we can't cleanly get affiliation
> s from
.     drop if inlist(pmid, 33471991, 28445112, 28121514, 30345907, 27192541, 25
> 029335, 23862974, 30332564, 31995857, 34161704)
  4.     drop if inlist(pmid, 29669224, 35196427,26943629,28657829,34161705,311
> 66681,29539279, 33264556, 33631065, 33306283, 33356051)
  5.     drop if inlist(pmid, 34587383, 34260849, 34937145, 34914868, 33332779,
>  36286256, 28657871, 35353979, 33631066, 27959715)
  6.     drop if inlist(pmid, 29045205, 27376580, 29800062)
  7.     cap drop _merge
  8.     merge 1:1 pmid using ../external/wos/`samp'_appended, assert(1 2 3) //
>  need to pull in all pmids from wos // to do after i scrape all wos
  9.     qui drop if _merge == 2
 10.     tab _merge
 11.     keep if strpos(doc_type, "Article")>0
 12.     drop if strpos(doc_type, "Retracted")>0
 13.     qui keep if _merge == 3
 14.     drop _merge
 15.     if "`samp'" == "med" local samp_type "main"
 16.     merge 1:1 pmid using ../external/`samp_type'_total/`samp'_all_pmids, a
> ssert(2 3) keep(3) nogen
 17.     replace year = pub_year if !mi(pub_year)
 18.     preserve
 19.     gcontract year journal_abbr, freq(num_articles)
 20.     drop if journal_abbr == "annals"
 21.     save ../temp/`samp'_counts, replace
 22.     restore 
 23.     /*merge 1:m pmid using ../external/cleaned_samps/cleaned_all_fund_`sam
> p', assert(1 3) keep(1) nogen keepusing(pmid)
>     merge 1:m pmid using ../external/cleaned_samps/cleaned_all_dis_`samp', as
> sert(1 3) keep(1) nogen keepusing(pmid)
>     merge 1:m pmid using ../external/cleaned_samps/cleaned_all_thera_`samp', 
> assert(1 3) keep(1) nogen keepusing(pmid)
>     keep pmid year journal_abbr
>     save ../output/`samp'_unmatched, replace*/
. end

. program top_jrnls
  1.     syntax, data(str) samp(str) 
  2.     use ../external/cleaned_samps/cleaned_all_`data'_`samp', clear
  3.     preserve
  4.     gcollapse (sum) pmid_counter, by(journal_abbr year)
  5.     qui merge 1:1 journal_abbr year using ../temp/`samp'_counts, assert(1 
> 2 3) keep(2 3) nogen
  6.     gen percent_of_tot = pmid_counter/num_articles
  7.     gcollapse (mean) avg_articles = pmid_counter avg_perc = percent_of_tot
>  num_articles, by(journal_abbr)
  8.     gen order = 0
  9.     replace order = 1 if inlist(journal_abbr, "science","nature","cell")
 10.     qui hashsort -order -num_articles
 11.     qui replace avg_perc = avg_perc * 100
 12.     li 
 13.     mkmat num_articles,  mat(top_jrnls_`samp'_N)
 14.     mkmat avg_perc ,  mat(top_jrnls_`data'_`samp')
 15.     mat top_jrnls_`samp' = nullmat(top_jrnls_`samp'), top_jrnls_`data'_`sa
> mp'
 16.     restore
 17. end 

. 
. program samp_size
  1.     syntax, data(str) samp(str) 
  2.     foreach t in all last5yrs {
  3.         use ../external/cleaned_samps/cleaned_`t'_`data'_`samp', clear
  4.         di "SAMPLE IS  `data' `samp' `t':"
  5.         qui gunique pmid
  6.         di "# articles = " r(unique)
  7.         mat N_`data'_`samp'_`t' = r(unique)
  8.         qui gunique pmid which_athr
  9.         di "# athr-articles = " r(unique)
 10.         qui gunique pmid which_athr which_affiliation if !mi(affiliation)
 11.         di "# athr-affl-articles = " r(unique)
 12.         mat N_`data'_`samp' = nullmat(N_`data'_`samp') , N_`data'_`samp'_`
> t'
 13.     }
 14. end

. ** 
. main
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        30,867
        from master                     6,733  (_merge==1)
        from using                     24,134  (_merge==2)

    Matched                            75,299  (_merge==3)
    -----------------------------------------

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |      6,733        8.21        8.21
            Matched (3) |     75,299       91.79      100.00
------------------------+-----------------------------------
                  Total |     82,032      100.00
(22,783 observations deleted)
(3 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            59,246  
    -----------------------------------------
(1,061 real changes made)
(0 observations deleted)
(file ../temp/cns_counts.dta not found)
file ../temp/cns_counts.dta saved
SAMPLE IS : cns newfund
(3 real changes made)

     +------------------------------------------------------+
     | journa~r   avg_ar~s   avg_perc   num_artic~s   order |
     |------------------------------------------------------|
  1. |  science   377.1429   54.39524   710.7999878       1 |
  2. |   nature   442.5429    67.3965   690.6286011       1 |
  3. |     cell   267.9429   91.63817   291.3143005       1 |
     +------------------------------------------------------+
SAMPLE IS  newfund cns all:
# articles = 38067
# athr-articles = 341139
# athr-affl-articles = 279125
SAMPLE IS  newfund cns last5yrs:
# articles = 9137
# athr-articles = 140398
# athr-affl-articles = 220368
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        14,825
        from master                       592  (_merge==1)
        from using                     14,233  (_merge==2)

    Matched                            31,263  (_merge==3)
    -----------------------------------------

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |        592        1.86        1.86
            Matched (3) |     31,263       98.14      100.00
------------------------+-----------------------------------
                  Total |     31,855      100.00
(4,025 observations deleted)
(1 observation deleted)
(variable pmid was long, now double to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            27,829  
    -----------------------------------------
(1,792 real changes made)
(0 observations deleted)
(file ../temp/scisub_counts.dta not found)
file ../temp/scisub_counts.dta saved
SAMPLE IS : scisub newfund
(0 real changes made)

     +------------------------------------------------------------+
     |   journal_abbr   avg_ar~s   avg_perc   num_artic~s   order |
     |------------------------------------------------------------|
  1. |         neuron   176.2941   85.64103   206.1764679       0 |
  2. |      nat_neuro   118.5833   75.07793        156.25       0 |
  3. |      nat_genet   123.7419    82.4359   151.6451569       0 |
  4. |        nat_med   113.4286   82.34001   137.1785736       0 |
  5. |   nat_cell_bio   101.5833   89.77684   114.4583359       0 |
     |------------------------------------------------------------|
  6. |   nat_chem_bio   95.94444    91.1012   103.6666641       0 |
  7. |    nat_biotech   66.22222    70.3898   96.22222137       0 |
  8. | cell_stem_cell     75.875   92.31258         82.25       0 |
     +------------------------------------------------------------+
SAMPLE IS  newfund scisub all:
# articles = 23019
# athr-articles = 252715
# athr-affl-articles = 226758
SAMPLE IS  newfund scisub last5yrs:
# articles = 7499
# athr-articles = 114430
# athr-affl-articles = 182712
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        54,807
        from master                     7,792  (_merge==1)
        from using                     47,015  (_merge==2)

    Matched                           374,993  (_merge==3)
    -----------------------------------------

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |      7,792        2.04        2.04
            Matched (3) |    374,993       97.96      100.00
------------------------+-----------------------------------
                  Total |    382,785      100.00
(11,337 observations deleted)
(8 observations deleted)
(variable pmid was long, now double to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           371,440  
    -----------------------------------------
(22,410 real changes made)
(0 observations deleted)
(file ../temp/demsci_counts.dta not found)
file ../temp/demsci_counts.dta saved
SAMPLE IS : demsci newfund
(0 real changes made)

     +------------------------------------------------------+
     | journa~r   avg_ar~s   avg_perc   num_artic~s   order |
     |------------------------------------------------------|
  1. |     plos   10040.29   72.70188   13024.35254       0 |
  2. |      jbc       3017   89.56652   3468.342773       0 |
  3. |     onco   444.0571   91.22021   492.4857178       0 |
  4. |    faseb   267.6857   81.89367   325.6285706       0 |
     +------------------------------------------------------+
SAMPLE IS  newfund demsci all:
# articles = 301191
# athr-articles = 1953765
# athr-affl-articles = 1588513
SAMPLE IS  newfund demsci last5yrs:
# articles = 116865
# athr-articles = 829601
# athr-affl-articles = 1120110
(10 observations deleted)
(11 observations deleted)
(8 observations deleted)
(3 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        52,477
        from master                     4,873  (_merge==1)
        from using                     47,604  (_merge==2)

    Matched                            64,235  (_merge==3)
    -----------------------------------------

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |      4,873        7.05        7.05
            Matched (3) |     64,235       92.95      100.00
------------------------+-----------------------------------
                  Total |     69,108      100.00
(31,040 observations deleted)
(13 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            38,055  
    -----------------------------------------
(554 real changes made)
(35 observations deleted)
(file ../temp/med_counts.dta not found)
file ../temp/med_counts.dta saved
SAMPLE IS : med clin
(0 real changes made)

     +------------------------------------------------------+
     | journa~r   avg_ar~s   avg_perc   num_artic~s   order |
     |------------------------------------------------------|
  1. |      bmj   173.4571    59.9355   281.7999878       0 |
  2. |   lancet   153.2286   63.56968   246.7142792       0 |
  3. |     jama   117.6857    54.3946   229.4857178       0 |
  4. |     nejm   137.2571   63.04796   217.4571381       0 |
     +------------------------------------------------------+
SAMPLE IS  clin med all:
# articles = 20357
# athr-articles = 190603
# athr-affl-articles = 140592
SAMPLE IS  clin med last5yrs:
# articles = 4234
# athr-articles = 83926
# athr-affl-articles = 108239

. 
end of do-file

--------------------------------------------------------------------------------
Makelog ended: 2023-03-23 12:41:51
Working directory: /export/home/dor/cxu/innovation_projs/analysis/science_geo/jrnl_samp_size/code
--------------------------------------------------------------------------------
