--------------------------------------------------------------------------------
Makelog started: 2023-08-03 19:39:29
Working directory: /export/home/dor/cxu/innovation_projs/analysis/science_geo/cluster_descriptives/code
--------------------------------------------------------------------------------
External links successfully created!

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Unlimited-user 4-core, expiring 17 Nov 2023
Serial number: 501709306977
  Licensed to: Harvard Business School
               Research Computing

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 120,000; see help set_maxvar.

. do "/export/home/dor/cxu/innovation_projs/analysis/science_geo/cluster_descri
> ptives/code/analysis.do" 

. set more off

. clear all

. capture log close

. program drop _all

. set scheme modern

. pause on

. set seed 8975

. here, set
/export/home/dor/cxu/innovation_projs/analysis/science_geo/cluster_descriptives
> /code/

. 
. program main
  1.     global pubmed_name "PubMed"
  2.     regression
  3.     output_tables
  4. end

. 
. program regression 
  1.     use ../external/pubmed/athr_panel_full, clear
  2.     gegen msa = group(msatitle)
  3.     gen ln_basic = ln(affl_wt)
  4.     gen ln_cluster = ln(cluster_shr)
  5.     qui reghdfe ln_basic ln_cluster, absorb(year msa) 
  6.     local slope: di %3.2f _b[ln_cluster]
  7.     binscatter2 ln_basic ln_cluster, absorb(year msa) xtitle("ln(Cluster S
> hare)") ytitle("ln(Basic Research)") legend(on order(- "Slope = `slope'") siz
> e(small) pos(5) ring(0) region(lwidth(none))) 
  8.     graph export ../output/figures/bs.pdf, replace
  9.     
.     reghdfe ln_basic ln_cluster, noabsorb
 10.     mat coef = nullmat(coef), (_b[ln_cluster] \ e(N))
 11.     reghdfe ln_basic ln_cluster, absorb(year)
 12.     mat coef = nullmat(coef), (_b[ln_cluster] \ e(N))
 13.     reghdfe ln_basic ln_cluster, absorb(year msa)
 14.     mat coef = nullmat(coef), (_b[ln_cluster] \ e(N))
 15.     reghdfe ln_basic ln_cluster, absorb(year msa athr_id)
 16.     mat coef = nullmat(coef), (_b[ln_cluster] \ e(N))
 17. end

. program output_tables
  1.     foreach file in coef { 
  2.          qui matrix_to_txt, saving("../output/tables/`file'.txt") matrix(`
> file') ///
>            title(<tab:`file'>) format(%20.4f) replace
  3.     }
  4. 
. end

. ** 
. main
Variable msatitle not found
r(111);

end of do-file
r(111);

