--------------------------------------------------------------------------------
Makelog started: 2023-07-08 15:15:09
Working directory: /export/home/dor/cxu/innovation_projs/analysis/science_geo/cluster_descriptives/code
--------------------------------------------------------------------------------
External links successfully created!

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Unlimited-user 4-core, expiring 17 Nov 2023
Serial number: 501709306977
  Licensed to: Harvard Business School
               Research Computing

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 120,000; see help set_maxvar.

. do "/export/home/dor/cxu/innovation_projs/analysis/science_geo/cluster_descri
> ptives/code/analysis.do" 

. set more off

. clear all

. capture log close

. program drop _all

. set scheme modern

. pause on

. set seed 8975

. here, set
/export/home/dor/cxu/innovation_projs/analysis/science_geo/cluster_descriptives
> /code/

. 
. program main
  1.     global pubmed_name "PubMed"
  2.     global acs_name "ACS Life Science"
  3.     global bio_name "ACS Bio/Medicine"
  4.     merge_in_pubmed
  5.     cluster_desc
  6.     output_tables
  7. end

. 
. program merge_in_pubmed 
  1.     use ../external/pubmed/athr_panel, clear
  2.     rename (cluster_shr cite_affl_wt msa_comb) (pubmed_cluster article_cnt
>  msatitle)
  3.     merge m:1 msatitle year using ../external/acs/acs_clusters, assert(1 2
>  3) keep(1 3) nogen 
  4.     rename cluster_shr acs_cluster
  5.     gegen msa = group(msatitle)
  6. 
.     preserve
  7.     gcollapse (mean) pubmed_cluster acs_cluster bio_cluster, by(msatitle)
  8.     gsort -pubmed_cluster
  9.     gen msa_label = msatitle if inlist(msatitle, "Boston-Cambridge-Newton,
>  MA-NH", "New York-Newark-Jersey City, NY-NJ-PA", "Washington-Arlington-Alexa
> ndria, DC-VA-MD-WV", "Bay Area, CA")
 10.     gen clock =  .
 11.     replace clock = 9 if inlist(msa_label, "New York-Newark-Jersey City, N
> Y-NJ-PA", "Bay Area, CA")
 12.     replace clock = 6 if inlist(msa_label, "Washington-Arlington-Alexandri
> a, DC-VA-MD-WV")
 13.     corr pubmed_cluster acs_cluster
 14.     local corr: di %3.2f r(rho)
 15.     tw scatter pubmed_cluster acs_cluster, mlabel(msa_label) xtitle("ACS L
> ife Sciences Cluster Size") ytitle("Pubmed Cluster Size") mlabsize(small) mla
> bcolor(black) mlabvp(clock) ///
>      legend(on order(- "Correlation = `corr'") size(small) pos(5) ring(0) reg
> ion(lwidth(none))) 
 16.     graph export ../output/figures/pubmed_acs_corr.pdf, replace
 17.     corr pubmed_cluster bio_cluster
 18.     local corr: di %3.2f r(rho)
 19.     tw scatter pubmed_cluster bio_cluster, mlabel(msa_label) xtitle("ACS B
> iologist/Medical Scientists Cluster Size") ytitle("Pubmed Cluster Size") mlab
> size(small) mlabcolor(black) mlabvp(clock) ///
>      legend(on order(- "Correlation = `corr'") size(small) pos(5) ring(0) reg
> ion(lwidth(none))) 
 20.     graph export ../output/figures/pubmed_acs_bio_corr.pdf, replace
 21.     restore
 22. end

. program cluster_desc
  1.     gen ln_basic = ln(article_cnt)
  2.     gen ln_pubmed_cluster = ln(pubmed_cluster)
  3.     gen ln_acs_cluster = ln(acs_cluster)
  4.     gen ln_bio_cluster = ln(bio_cluster)
  5.     foreach c in pubmed {
  6.         qui reghdfe ln_basic ln_`c'_cluster, absorb(year msa) 
  7.         local slope: di %3.2f _b[ln_`c'_cluster]
  8.         binscatter2 ln_basic ln_`c'_cluster, absorb(year msa) xtitle("ln($
> {`c'_name})") ytitle("ln(Basic Research)") legend(on order(- "Slope = `slope'
> ") size(small) pos(5) ring(0) region(lwidth(none))) 
  9.         graph export ../output/figures/bs_`c'.pdf, replace
 10.     }
 11.     foreach c in pubmed {
 12.         reghdfe ln_basic ln_`c'_cluster, noabsorb
 13.         mat `c'_coef = nullmat(`c'_coef), (_b[ln_`c'_cluster] \ e(N))
 14.         reghdfe ln_basic ln_`c'_cluster, absorb(year)
 15.         mat `c'_coef = nullmat(`c'_coef), (_b[ln_`c'_cluster] \ e(N))
 16.         reghdfe ln_basic ln_`c'_cluster, absorb(year msa)
 17.         mat `c'_coef = nullmat(`c'_coef), (_b[ln_`c'_cluster] \ e(N))
 18.         reghdfe ln_basic ln_`c'_cluster, absorb(year msa name_grp)
 19.         mat `c'_coef = nullmat(`c'_coef), (_b[ln_`c'_cluster] \ e(N))
 20.     }
 21. end

. program output_tables
  1.     *mat coef = pubmed_coef \ acs_coef
. 
.     foreach file in pubmed_coef { //acs_coef bio_coef  {
  2.          qui matrix_to_txt, saving("../output/tables/`file'.txt") matrix(`
> file') ///
>            title(<tab:`file'>) format(%20.4f) replace
  3.     }
  4. 
. end

. ** 
. main
(variable msatitle was str46, now str50 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        16,509
        from master                    16,509  
        from using                          0  

    Matched                            74,836  
    -----------------------------------------
(283 missing values generated)
(287 missing values generated)
(2 real changes made)
(1 real change made)
(obs=199)

             | pubmed~r acs_cl~r
-------------+------------------
pubmed_clu~r |   1.0000
 acs_cluster |   0.8257   1.0000

file ../output/figures/pubmed_acs_corr.pdf saved as PDF format
(obs=199)

             | pubmed~r bio_cl~r
-------------+------------------
pubmed_clu~r |   1.0000
 bio_cluster |   0.9070   1.0000

file ../output/figures/pubmed_acs_bio_corr.pdf saved as PDF format
(1,056 missing values generated)
(638 missing values generated)
(16,509 missing values generated)
(18,468 missing values generated)
file ../output/figures/bs_pubmed.pdf saved as PDF format
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     89,680
Absorbing 1 HDFE group                            F(   1,  89678) =    4760.42
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0504
                                                  Adj R-squared   =     0.0504
                                                  Within R-sq.    =     0.0504
                                                  Root MSE        =     1.2178

------------------------------------------------------------------------------
    ln_basic | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
ln_pubmed_~r |   .2103436   .0030486    69.00   0.000     .2043683     .216319
       _cons |  -.0249905   .0127576    -1.96   0.050    -.0499953    .0000144
------------------------------------------------------------------------------
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     89,680
Absorbing 1 HDFE group                            F(   1,  89658) =    4468.11
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0617
                                                  Adj R-squared   =     0.0615
                                                  Within R-sq.    =     0.0475
                                                  Root MSE        =     1.2107

------------------------------------------------------------------------------
    ln_basic | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
ln_pubmed_~r |   .2034972   .0030444    66.84   0.000     .1975303    .2094641
       _cons |  -.0521462    .012734    -4.10   0.000    -.0771047   -.0271878
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        21           0          21     |
-----------------------------------------------------+
(dropped 3 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     89,677
Absorbing 2 HDFE groups                           F(   1,  89444) =       4.39
                                                  Prob > F        =     0.0362
                                                  R-squared       =     0.0907
                                                  Adj R-squared   =     0.0883
                                                  Within R-sq.    =     0.0000
                                                  Root MSE        =     1.1932

------------------------------------------------------------------------------
    ln_basic | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
ln_pubmed_~r |   -.037197   .0177571    -2.09   0.036    -.0720008   -.0023933
       _cons |  -1.006798   .0705419   -14.27   0.000    -1.145059   -.8685363
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        21           0          21     |
         msa |       212           1         211     |
-----------------------------------------------------+
(dropped 62540 singleton observations)
(MWFE estimator converged in 21 iterations)

HDFE Linear regression                            Number of obs   =     27,140
Absorbing 3 HDFE groups                           F(   1,  14927) =       1.18
                                                  Prob > F        =     0.2772
                                                  R-squared       =     0.7547
                                                  Adj R-squared   =     0.5541
                                                  Within R-sq.    =     0.0001
                                                  Root MSE        =     0.8421

------------------------------------------------------------------------------
    ln_basic | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
ln_pubmed_~r |  -.0369946   .0340411    -1.09   0.277    -.1037194    .0297302
       _cons |  -.9733731   .1339949    -7.26   0.000     -1.23602   -.7107266
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        21           0          21     |
         msa |       164           1         163     |
    name_grp |     12034           6       12028    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
end of do-file

--------------------------------------------------------------------------------
Makelog ended: 2023-07-08 15:15:15
Working directory: /export/home/dor/cxu/innovation_projs/analysis/science_geo/cluster_descriptives/code
--------------------------------------------------------------------------------
