--------------------------------------------------------------------------------
Makelog started: 2023-08-23 14:05:11
Working directory: /export/home/dor/cxu/innovation_projs/derived/science_geo/openalex/create_pmid_list/code
--------------------------------------------------------------------------------
External links successfully created!

  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Unlimited-user 4-core, expiring 17 Nov 2023
Serial number: 501709306977
  Licensed to: Harvard Business School
               Research Computing

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 120,000; see help set_maxvar.

. do "/export/home/dor/cxu/innovation_projs/derived/science_geo/openalex/create
> _pmid_list/code/build.do" 

. set more off

. clear all

. capture log close

. program drop _all

. set scheme modern

. pause on

. set seed 8975

. here, set
/export/home/dor/cxu/innovation_projs/derived/science_geo/openalex/create_pmid_
> list/code/

. set maxvar 120000


. global temp "/export/scratch/cxu_sci_geo/openalex"

. 
. program main
  1.     get_newfund_pmids
  2.     get_clin_pmids
  3. end

. program get_newfund_pmids
  1.     // these are jouranl articles from pubmed
.     use ../external/pmids/cleaned_all_jrnl_base, clear
  2.     *merge 1:1 pmid using ../external/wos/all_jrnls_appended.dta, assert(1
>  2 3) keep(3) nogen 
.     merge 1:1 pmid using ../external/xwalk/newfund_pmids, assert(1 2 3) keep(
> 3) nogen
  3. /*    gen lower_title = strlower(title)
>     drop if strpos(lower_title, "economic")>0
>     drop if strpos(lower_title, "economy")>0
>     drop if strpos(lower_title, "accountable care")>0 | strpos(title, "ACOs")
> >0
>     drop if strpos(lower_title, "health care")>0
>     drop if strpos(lower_title, "health-care")>0
>     drop if strpos(lower_title, "public health")>0
>     drop if strpos(lower_title, "government")>0
>     drop if strpos(lower_title, "reform")>0
>     drop if strpos(lower_title , "quality")>0
>     drop if strpos(lower_title , "equity")>0
>     drop if strpos(lower_title , "payment")>0
>     drop if strpos(lower_title , "politics")>0
>     drop if strpos(lower_title , "policy")>0
>     drop if strpos(lower_title , "comment")>0
>     drop if strpos(lower_title , "guideline")>0
>     drop if strpos(lower_title , "professionals")>0
>     drop if strpos(lower_title , "physician")>0
>     drop if strpos(lower_title , "workforce")>0
>     drop if strpos(lower_title , "medical-education")>0
>     drop if strpos(lower_title , "medical education")>0
>     drop if strpos(lower_title , "funding")>0
>     drop if strpos(lower_title , "conference")>0
>     drop if strpos(lower_title , "insurance")>0
>     drop if strpos(lower_title , "fellowship")>0
>     drop if strpos(lower_title , "ethics")>0
>     drop if strpos(lower_title , "legislation")>0
>     drop if strpos(lower_title , " regulation")>0*/
.     gcontract pmid
  4.     drop _freq
  5.     save ../output/list_of_pmids_newfund_jrnls, replace 
  6. end

. 
. program get_clin_pmids
  1.     use ../external/pmids/cleaned_clin_med_base, clear
  2.     *merge 1:1 pmid using ../external/wos/med_appended.dta, assert(1 2 3) 
> keep(3) nogen 
.     merge 1:1 pmid using ../external/xwalk/med_all_pmids, assert(1 2 3) keep(
> 3) nogen
  3. /*    gen lower_title = strlower(title)
>     drop if strpos(lower_title, "economic")>0
>     drop if strpos(lower_title, "economy")>0
>     drop if strpos(lower_title, "accountable care")>0 | strpos(title, "ACOs")
> >0
>     drop if strpos(lower_title, "health care")>0
>     drop if strpos(lower_title, "health-care")>0
>     drop if strpos(lower_title, "public health")>0
>     drop if strpos(lower_title, "government")>0
>     drop if strpos(lower_title, "reform")>0
>     drop if strpos(lower_title , "quality")>0
>     drop if strpos(lower_title , "equity")>0
>     drop if strpos(lower_title , "payment")>0
>     drop if strpos(lower_title , "politics")>0
>     drop if strpos(lower_title , "policy")>0
>     drop if strpos(lower_title , "comment")>0
>     drop if strpos(lower_title , "guideline")>0
>     drop if strpos(lower_title , "professionals")>0
>     drop if strpos(lower_title , "physician")>0
>     drop if strpos(lower_title , "workforce")>0
>     drop if strpos(lower_title , "medical-education")>0
>     drop if strpos(lower_title , "medical education")>0
>     drop if strpos(lower_title , "funding")>0
>     drop if strpos(lower_title , "conference")>0
>     drop if strpos(lower_title , "insurance")>0
>     drop if strpos(lower_title , "fellowship")>0
>     drop if strpos(lower_title , "ethics")>0
>     drop if strpos(lower_title , "legislation")>0
>     drop if strpos(lower_title , " regulation")>0*/
.     gcontract pmid
  4.     drop _freq
  5.     save ../output/list_of_pmids_clin_med, replace 
  6. end

. main
(variable pmid was long, now double to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           561,544  
    -----------------------------------------
(file ../output/list_of_pmids_newfund_jrnls.dta not found)
file ../output/list_of_pmids_newfund_jrnls.dta saved

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                           250,109  
    -----------------------------------------
(file ../output/list_of_pmids_clin_med.dta not found)
file ../output/list_of_pmids_clin_med.dta saved

. 
end of do-file

--------------------------------------------------------------------------------
Makelog ended: 2023-08-23 14:05:12
Working directory: /export/home/dor/cxu/innovation_projs/derived/science_geo/openalex/create_pmid_list/code
--------------------------------------------------------------------------------
